[
  {
    "ID": "1",
    "Title": "Avatar",
    "Rating": 4.5,
    "Year": 2009,
    "Poster": "https://i.pinimg.com/originals/f3/f0/4a/f3f04a485eaad60915d70bb3df8e6440.jpg",
    "Description": "To explore Pandora, genetically matched human scientists use Na'vi-human hybrids called avatars. Paraplegic Marine Jake Sully is sent to Pandora to replace his deceased identical twin, who had signed up to be an operator."
  },
  {
    "ID": "2",
    "Title": "Venom",
    "Rating": 4.2,
    "Year": 2017,
    "Poster": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcTvGNXRmC76GfZrgM7P_oY0nZqg00bsjC7E5zu4dZBReXiHD_kt",
    "Description": "venom, the poisonous secretion of an animal, produced by specialized glands that are often associated with spines, teeth, stings, or other piercing devices. The venom apparatus may be primarily for killing or paralyzing prey or may be a purely defensive adaptation. Some venoms also function as digestive fluids"
  },
  {
    "ID": "3",
    "Title": "Hex",
    "Rating": 3,
    "Year": 2020,
    "Poster": "https://www.dvdsreleasedates.com/posters/800/H/Hex-2018-movie-poster.jpg",
    "Description": "Following a mysterious disappearance on a jump, a group of skydivers experience paranormal occurrences that leave them fighting for their lives. Skydiving gets scarier."
  },
  {
    "ID": "4",
    "Title": "Spider-man",
    "Rating": 4.3,
    "Year": 2002,
    "Poster": "https://www.themoviedb.org/t/p/original/ynyDOCwNuYqqR6p1d6Nbk7ehpfv.jpg",
    "Description": "Superhuman strength, agility, endurance, ability to stick to and climb walls and other surfaces, uses self-designed web-shooters allowing him to fire and swing from sticky webs, special Spider-Sense warns of incoming danger, genius intellect specializing in chemistry and invention."
  },
  {
    "ID": "5",
    "Title": "King-Kong",
    "Rating": 4.3,
    "Year": 2005,
    "Poster": "https://m.media-amazon.com/images/I/51Mti6Xa2PL._AC_UF894,1000_QL80_.jpg",
    "Description": "Set in 1933, it follows the story of an ambitious filmmaker who coerces his cast and hired ship crew to travel to mysterious Skull Island. There they encounter prehistoric creatures and a legendary giant gorilla known as Kong, whom they capture and take to New York City."
  },
  {
    "ID": "6",
    "Title": "Joker",
    "Rating": 4,
    "Year": 2019,
    "Poster": "https://www.joblo.com/wp-content/uploads/2019/08/joker-poster-main3-1.jpg",
    "Description": "Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles."
  },
  {
    "ID": "7",
    "Title": "The Shining",
    "Rating": 3,
    "Year": 1980,
    "Poster": "https://s3.amazonaws.com/nightjarprod/content/uploads/sites/192/2022/05/05152719/b6ko0IKC8MdYBBPkkA1aBPLe2yz.jpg",
    "Description": "Synopsis. Former teacher and recovering alcoholic Jack Torrance (Jack Nicholson) interviews for a caretaker job at the Overlook Hotel in an effort to rebuild his life after his volatile temper lost him his teaching position. The hotel manager, Mr."
  },
  {
    "ID": "8",
    "Title": "Halloween",
    "Rating": 4,
    "Year": 2018,
    "Poster": "https://media.newstracklive.com/uploads/entertainment/hollywood-news/Oct/17/big_thumb/h1_5bc6ba62dba87.jpg",
    "Description": "On Halloween night in 1963, in the fictional suburban town of Haddonfield, Illinois, six-year-old Michael Myers stabs his teenage sister Judith to death with a chef's knife. For fifteen years, Michael is incarcerated at Smith's Grove Sanitarium, during which time he never speaks a word."
  }
]
